InformationRegisters/НастройкиИнтеграцииСБухгалтерией.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>НастройкиИнтеграцииСБухгалтерией</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Использование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерОбласти</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиИнтеграцииСБухгалтерией/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ТекущаяНастройка() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Использование", Ложь);
	Результат.Вставить("АдресПриложения", "");
	Результат.Вставить("НомерОбласти", 0);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НастройкиИнтеграцииСБухгалтерией.Использование КАК Использование,
	|	НастройкиИнтеграцииСБухгалтерией.АдресПриложения КАК АдресПриложения,
	|	НастройкиИнтеграцииСБухгалтерией.НомерОбласти КАК НомерОбласти
	|ИЗ
	|	РегистрСведений.НастройкиИнтеграцииСБухгалтерией КАК НастройкиИнтеграцииСБухгалтерией");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДоступныеПриложенияБухгалтерии() Экспорт
	
	ПриложенияПользователя = ПрограммныйИнтерфейсСервиса.Приложения();
	
	Отбор = Новый Структура;
	Отбор.Вставить("СостояниеПриложения", Перечисления.СостоянияПриложений.Используется);
	Отбор.Вставить("ИмяВидаПриложения", "БухгалтерияПредприятия");
	
	Возврат ПриложенияПользователя.Скопировать(Отбор, "Код,АдресПриложения,Наименование");
	
КонецФункции

Функция УстановитьПараметрыПодключенияКБухгалтерии(ОписаниеПриложения) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОбластьДанныхВспомогательныеДанные.Установить(РаботаВМоделиСервиса.ЗначениеРазделителяСеанса());
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда
		ЕстьИзменения = Ложь;
		
		Если НаборЗаписей[0].АдресПриложения <> ОписаниеПриложения.АдресПриложения Тогда
			НаборЗаписей[0].АдресПриложения = ОписаниеПриложения.АдресПриложения;
			ЕстьИзменения = Истина;
		КонецЕсли;
		Если НаборЗаписей[0].НомерОбласти <> ОписаниеПриложения.Код Тогда
			НаборЗаписей[0].НомерОбласти = ОписаниеПриложения.Код;
			ЕстьИзменения = Истина;
		КонецЕсли;
		
		Если ЕстьИзменения Тогда
			НаборЗаписей.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
